# CreateLineWeightPopup

## Description
Create a line weight popup dialog control to display list of line weights available in current document.

```pascal
PROCEDURE CreateLineWeightPopup(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python

def vs.CreateLineWeightPopup(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|itemID|LONGINT||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern